In [1]:
import numpy as np
import pandas as pd

In [2]:
## read data from csv file
# file_path = "path.csv"
df = pd.read_csv('Used_Bikes.csv')
df

,bike_name,price,city,kms_driven,owner,age,power,brand
0,TVS Star City Plus Dual Tone 110cc,35000.0,Ahmedabad,17654.0,First Owner,3.0,110.0,TVS
1,Royal Enfield Classic 350cc,119900.0,Delhi,11000.0,First Owner,4.0,350.0,Royal Enfield
2,Triumph Daytona 675R,600000.0,Delhi,110.0,First Owner,8.0,675.0,Triumph
3,TVS Apache RTR 180cc,65000.0,Bangalore,16329.0,First Owner,4.0,180.0,TVS
4,Yamaha FZ S V 2.0 150cc-Ltd. Edition,80000.0,Bangalore,10000.0,First Owner,3.0,150.0,Yamaha
...,...,...,...,...,...,...,...,...
32643,Hero Passion Pro 100cc,39000.0,Delhi,22000.0,First Owner,4.0,100.0,Hero
32644,TVS Apache RTR 180cc,30000.0,Karnal,6639.0,First Owner,9.0,180.0,TVS
32645,Bajaj Avenger Street 220,60000.0,Delhi,20373.0,First Owner,6.0,220.0,Bajaj
32646,Hero Super Splendor 125cc,15600.0,Jaipur,84186.0,First Owner,16.0,125.0,Hero
32647,Bajaj Pulsar 150cc,22000.0,Pune,60857.0,First Owner,13.0,150.0,Bajaj

In [3]:
data = {'A':[2,5,np.nan,8,np.nan,9],
        'B':[np.nan,45,np.nan,89,63,np.nan], 
        'C':[np.nan,74,np.nan,np.nan,85,4], 
        'D':[10,20,30,40,50,60]}
data

{'A': [2, 5, nan, 8, nan, 9],
 'B': [nan, 45, nan, 89, 63, nan],
 'C': [nan, 74, nan, nan, 85, 4],
 'D': [10, 20, 30, 40, 50, 60]}

In [4]:
df = pd.DataFrame(data)
df

# NAN ==> none or missing values

     A     B     C   D
0  2.0   NaN   NaN  10
1  5.0  45.0  74.0  20
2  NaN   NaN   NaN  30
3  8.0  89.0   NaN  40
4  NaN  63.0  85.0  50
5  9.0   NaN   4.0  60

In [ ]:
# 1. = Remove the record
# 2. = Fill the records

In [5]:
df.dropna()  # bydefault remove all those rows that are containing missing values

     A     B     C   D
1  5.0  45.0  74.0  20

In [7]:
df

     A     B     C   D
0  2.0   NaN   NaN  10
1  5.0  45.0  74.0  20
2  NaN   NaN   NaN  30
3  8.0  89.0   NaN  40
4  NaN  63.0  85.0  50
5  9.0   NaN   4.0  60

In [8]:
df.dropna(axis='columns')

    D
0  10
1  20
2  30
3  40
4  50
5  60

In [9]:
# For checkout missing values for small values
df

     A     B     C   D
0  2.0   NaN   NaN  10
1  5.0  45.0  74.0  20
2  NaN   NaN   NaN  30
3  8.0  89.0   NaN  40
4  NaN  63.0  85.0  50
5  9.0   NaN   4.0  60

In [10]:
df.isnull().sum()  # find how many missing values in A,B,C ,D

A    2
B    3
C    3
D    0
dtype: int64

In [11]:
# for total missing values
print("Total missing values in your data : ")
df.isnull().sum().sum()

Total missing values in your data :

8

In [13]:
df.shape[0]

6

In [12]:
df.isnull().sum()/df.shape[0]*100

# percentage values

A    33.333333
B    50.000000
C    50.000000
D     0.000000
dtype: float64

In [ ]:
# Filling the records >>>>>>>>>>
# Before filling some points to be in mind
# Columns should be = Numerical or Categorical
# Numerical ==> Constant(100) , Mean or Average , Median
# Categorical ==> Constant , Mode

In [14]:
# Filling Constant values
df.fillna(500)

       A      B      C   D
0    2.0  500.0  500.0  10
1    5.0   45.0   74.0  20
2  500.0  500.0  500.0  30
3    8.0   89.0  500.0  40
4  500.0   63.0   85.0  50
5    9.0  500.0    4.0  60

In [16]:
# A = 500
# B = 600
# C = 700


df['A'].fillna(500)

0      2.0
1      5.0
2    500.0
3      8.0
4    500.0
5      9.0
Name: A, dtype: float64

In [17]:
df['B'].fillna(600)

0    600.0
1     45.0
2    600.0
3     89.0
4     63.0
5    600.0
Name: B, dtype: float64

In [18]:
# Filling Mean values

df['A'].mean()

6.0

In [19]:
df['A'].fillna(df['A'].mean())

0    2.0
1    5.0
2    6.0
3    8.0
4    6.0
5    9.0
Name: A, dtype: float64

In [20]:
df['A'].fillna(df['A'].median())

0    2.0
1    5.0
2    6.5
3    8.0
4    6.5
5    9.0
Name: A, dtype: float64